tests/fixtures/payment_intent/awaiting_capture.json

{
    "id": "pi_xxxxx",
    "resource": "payment_intent",
    "amount": 10000,
    "amount_received": 0,
    "amount_capturable": 10000,
    "client_secret": "pi_xxxxx_secret_xxxxx",
    "currency": "PHP",
    "description": "",
    "last_payment_error": null,
    "latest_payment": null,
    "livemode": false,
    "metadata": null,
    "next_action": null,
    "payment_method_options": {
        "card": {
            "capture_type": "manual"
        }
    },
    "payment_methods": ["card"],
    "statement_descriptor": null,
    "status": "awaiting_capture",
    "payment_method_id": "pm_xxxxx",
    "return_url": null,
    "capture_before_at": 1701012680,
    "customer": null,
    "created_at": 1700407880,
    "updated_at": 1700407900
}
